# specify a directory to install
cask_args appdir: "/Applications"

# install packages
tap "homebrew/bundle"
tap "romkatv/powerlevel10k"

# Fonts
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"

# CLI
brew "antigen"
brew "eza"
brew "homeshick"
brew "mas"
brew "powerlevel10k"

# Casks
cask "airflow"
cask "appcleaner"
cask "bettertouchtool"
cask "bitwarden"
cask "chronosync"
cask "calibre"
cask "discord"
cask "homerow"
cask "iina"
cask "itsycal"
cask "firefox"
cask "iterm2"
cask "macs-fan-control"
cask "monitorcontrol"
cask "pocket-casts"
cask "proton-mail"
cask "protonvpn"
cask "sanesidebuttons"
# cask "tailscale"
cask "visual-studio-code"

# App store
mas "Logic Pro", id: 634148309
mas "XCode", id: 497799835
mas "WhatsApp Messenger", id: 310633997
