# specify a directory to install
cask_args appdir: "/Applications"

# install packages
tap "homebrew/bundle"
tap "romkatv/powerlevel10k"

# Fonts
cask "font-hack-nerd-font"
cask "font-inconsolata-for-powerline"
cask "font-menlo-for-powerline"

# CLI
brew "antigen"
brew "eza"
brew "homeshick"
brew "mas"
brew "powerlevel10k"

# Casks
cask "airflow"
cask "arctic"
cask "appcleaner"
cask "bettertouchtool"
cask "bitwarden"
cask "chronosync"
cask "calibre"
cask "commandpost"
cask "daisydisk"
cask "discord"
cask "firefox"
cask "google-drive"
cask "homerow"
cask "iina"
cask "itsycal"
cask "iterm2"
cask "karabiner-elements"
cask "keycastr"
cask "little-snitch"
cask "logitech-g-hub"
cask "logseq"
cask "macs-fan-control"
cask "monitorcontrol"
cask "obsidian"
cask "pocket-casts"
cask "proton-mail"
cask "protonvpn"
cask "raycast"
cask "sanesidebuttons"
cask "sonos"
# cask "tailscale"
cask "todoist"
cask "visual-studio-code"

# App store
mas "App Locker", id: 1132845904
mas "Day One", id: 1055511498
mas "Final Cut Pro", id: 424389933
mas "Flow", id: 1423210932
mas "Logic Pro", id: 634148309
mas "rcmd", id: 1596283165
mas "XCode", id: 497799835
mas "WhatsApp Messenger", id: 310633997
